{
  "pageTitle": "Early Game",
  "pageDescription": "The beginning of your SWTOR journey. Discover the available classes and find the one that fits your playstyle.",
  "introText": "There are four unique classes per faction in SWTOR, and each class has two advanced classes. Explore the options below and find your ideal playstyle.",
  "storyLink": "Read the Story",
  "guideLink": "View Guide",
  "classOverview": "Class Overview",
  "chooseAllegiance": "Choose Your Allegiance",
  "theGalacticRepublic": "The Galactic Republic",
  "theSithEmpire": "The Sith Empire",
  "switchFaction": "Switch Faction",
  "galacticRepublic": "Galactic Republic",
  "republicDesc": "Defenders of democracy and freedom in the galaxy. The Galactic Republic fights to maintain peace and protect its citizens against the Sith Empire threat.",
  "empireSith": "Sith Empire",
  "empireDesc": "Ruled by the Sith, the Empire seeks to dominate the galaxy through the power of the Dark Side of the Force. Its agents and warriors are instruments of conquest and destruction.",
  "mirrorClasses": {
    "title": "Mirror Classes",
    "desc": "Each Republic class has an Imperial mirror with identical gameplay mechanics, but a completely different story. Choose based on which story appeals to you!",
    "pairs": [
      { "republic": "Jedi Knight", "empire": "Sith Warrior" },
      { "republic": "Jedi Consular", "empire": "Sith Inquisitor" },
      { "republic": "Trooper", "empire": "Bounty Hunter" },
      { "republic": "Smuggler", "empire": "Imperial Agent" }
    ]
  },
  "republicClasses": [
    {
      "name": "Jedi Knight",
      "desc": "Champions of peace and symbols of hope in dark times, Jedi Knights represent the legacy of the Jedi Order.",
      "playstyleTip": "Choose this if you want to be the classic Star Wars hero — lightsaber combat on the front lines, protecting allies or destroying enemies with controlled fury.",
      "advanced": [
        { "name": "Guardian", "role": "Tank / DPS" },
        { "name": "Sentinel", "role": "DPS" }
      ]
    },
    {
      "name": "Jedi Consular",
      "desc": "Visionaries, ambassadors, and seekers of hidden wisdom, the Jedi Consular has worked for millennia to promote peace and balance.",
      "playstyleTip": "Choose this if you prefer using the Force from range — healing allies, hurling objects with telekinesis, or infiltrating shadows with a double-bladed saber.",
      "advanced": [
        { "name": "Sage", "role": "Healer / DPS" },
        { "name": "Shadow", "role": "Tank / DPS" }
      ]
    },
    {
      "name": "Smuggler",
      "desc": "Quick, clever, and answering to no one, Smugglers know that sometimes luck is more important than skill — but it never hurts to have both.",
      "playstyleTip": "Choose this if you enjoy a lighter, wittier style — shooting blasters, using dirty tricks, improvised healing, or firing from cover with dual pistols.",
      "advanced": [
        { "name": "Scoundrel", "role": "Healer / DPS" },
        { "name": "Gunslinger", "role": "DPS" }
      ]
    },
    {
      "name": "Trooper",
      "desc": "Not all heroes carry lightsabers — some just have the will to fight. Troopers are the bravest and most determined of all.",
      "playstyleTip": "Choose this if you love heavy firepower — assault cannons, grenades, robust armor, and the role of an elite soldier protecting your squad.",
      "advanced": [
        { "name": "Commando", "role": "Healer / DPS" },
        { "name": "Vanguard", "role": "Tank / DPS" }
      ]
    }
  ],
  "imperialClasses": [
    {
      "name": "Sith Warrior",
      "desc": "Strong in the dark side of the Force, Sith Warriors are charged with the task of destroying the Empire's enemies across the galaxy.",
      "playstyleTip": "Choose this if you want to channel Dark Side fury — aggressive melee lightsaber combat, tanking enemies, or devastating with relentless dual-wield attacks.",
      "advanced": [
        { "name": "Juggernaut", "role": "Tank / DPS" },
        { "name": "Marauder", "role": "DPS" }
      ]
    },
    {
      "name": "Sith Inquisitor",
      "desc": "Sinister and deceptive, Sith Inquisitors are prodigies of Force power and experts in manipulating their enemies.",
      "playstyleTip": "Choose this if you want to master Force Lightning and manipulation — ranged healer/DPS as Sorcerer, or stealthy double-blade striker as Assassin.",
      "advanced": [
        { "name": "Sorcerer", "role": "Healer / DPS" },
        { "name": "Assassin", "role": "Tank / DPS" }
      ]
    },
    {
      "name": "Imperial Agent",
      "desc": "Unmatched assassins and saboteurs, Agents are the secret weapons of the Sith Empire, helping to secure control of countless star systems.",
      "playstyleTip": "Choose this if you love espionage and tactics — stealthy vibroblade ambushes, field medical support, or eliminating targets from range as an elite sniper.",
      "advanced": [
        { "name": "Operative", "role": "Healer / DPS" },
        { "name": "Sniper", "role": "DPS" }
      ]
    },
    {
      "name": "Bounty Hunter",
      "desc": "The Empire has many enemies — and they will pay Bounty Hunters generously to remove them with ruthless efficiency.",
      "playstyleTip": "Choose this if you want heavy tech and independence — flamethrowers, guided missiles, heavy armor, and the life of a hunter who answers to no one.",
      "advanced": [
        { "name": "Mercenary", "role": "Healer / DPS" },
        { "name": "Powertech", "role": "Tank / DPS" }
      ]
    }
  ]
}