{
  "pageTitle": "Early Game",
  "pageDescription": "O início da sua jornada em SWTOR. Conheça as classes disponíveis e escolha a que mais combina com você.",
  "introText": "Existem quatro classes únicas por facção em SWTOR, e cada classe tem duas classes avançadas. Explore as opções abaixo e descubra qual estilo de jogo é ideal para você.",
  "storyLink": "Ver História",
  "guideLink": "Ver Guia",
  "classOverview": "Visão Geral da Classe",
  "chooseAllegiance": "Escolha sua Aliança",
  "theGalacticRepublic": "A República Galáctica",
  "theSithEmpire": "O Império Sith",
  "switchFaction": "Trocar Facção",
  "galacticRepublic": "República Galáctica",
  "republicDesc": "Os defensores da democracia e da liberdade na galáxia. A República Galáctica luta para manter a paz e proteger seus cidadãos contra a ameaça do Império Sith.",
  "empireSith": "Império Sith",
  "empireDesc": "Governado pelos Sith, o Império busca dominar a galáxia através do poder do Lado Sombrio da Força. Seus agentes e guerreiros são instrumentos de conquista e destruição.",
  "mirrorClasses": {
    "title": "Classes Espelho",
    "desc": "Cada classe da República tem um espelho Imperial com mecânicas de gameplay idênticas, mas uma história completamente diferente. Escolha pela história que mais te atrai!",
    "pairs": [
      { "republic": "Jedi Knight", "empire": "Sith Warrior" },
      { "republic": "Jedi Consular", "empire": "Sith Inquisitor" },
      { "republic": "Trooper", "empire": "Bounty Hunter" },
      { "republic": "Smuggler", "empire": "Imperial Agent" }
    ]
  },
  "republicClasses": [
    {
      "name": "Jedi Knight",
      "desc": "Campeões da paz e símbolos de esperança em tempos sombrios, Jedi Knights representam o legado da Ordem Jedi.",
      "playstyleTip": "Escolha se você quer ser o herói clássico de Star Wars — combate com sabre de luz na linha de frente, protegendo aliados ou destruindo inimigos com fúria controlada.",
      "advanced": [
        { "name": "Guardian", "role": "Tank / DPS" },
        { "name": "Sentinel", "role": "DPS" }
      ]
    },
    {
      "name": "Jedi Consular",
      "desc": "Visionários, embaixadores e buscadores da sabedoria oculta, o Jedi Consular trabalha há milênios para promover paz e equilíbrio.",
      "playstyleTip": "Escolha se você prefere usar a Força à distância — curando aliados, arremessando objetos com telecinese ou se infiltrando nas sombras com um sabre duplo.",
      "advanced": [
        { "name": "Sage", "role": "Healer / DPS" },
        { "name": "Shadow", "role": "Tank / DPS" }
      ]
    },
    {
      "name": "Smuggler",
      "desc": "Rápido, inteligente e respondendo a ninguém, Smugglers sabem que às vezes a sorte é mais importante que a habilidade — mas nunca é demais ter os dois.",
      "playstyleTip": "Escolha se você curte um estilo mais leve e esperto — atirando com blasters, usando truques sujos, curando aliados de forma improvisada ou disparando de cobertura.",
      "advanced": [
        { "name": "Scoundrel", "role": "Healer / DPS" },
        { "name": "Gunslinger", "role": "DPS" }
      ]
    },
    {
      "name": "Trooper",
      "desc": "Nem todos os heróis carregam sabres de luz — alguns apenas têm a vontade de lutar. Os Troopers são os mais corajosos e determinados de todos.",
      "playstyleTip": "Escolha se você gosta de armamento pesado — canhões de assalto, granadas, armadura robusta e o papel de soldado de elite protegendo sua equipe.",
      "advanced": [
        { "name": "Commando", "role": "Healer / DPS" },
        { "name": "Vanguard", "role": "Tank / DPS" }
      ]
    }
  ],
  "imperialClasses": [
    {
      "name": "Sith Warrior",
      "desc": "Fortes no lado negro da Força, os Sith Warriors são encarregados da tarefa de destruir os inimigos do Império pela galáxia.",
      "playstyleTip": "Escolha se você quer canalizar a fúria do Lado Sombrio — combate corpo a corpo agressivo com sabre de luz, tankar inimigos ou devastar com ataques duplos implacáveis.",
      "advanced": [
        { "name": "Juggernaut", "role": "Tank / DPS" },
        { "name": "Marauder", "role": "DPS" }
      ]
    },
    {
      "name": "Sith Inquisitor",
      "desc": "Sinistro e enganoso, Sith Inquisitors são prodígios de poder da Força e especialistas em manipular seus inimigos.",
      "playstyleTip": "Escolha se você quer dominar relâmpagos da Força e manipulação — seja como curador/DPS à distância com Sorcerer, ou atacante furtivo com sabre duplo como Assassin.",
      "advanced": [
        { "name": "Sorcerer", "role": "Healer / DPS" },
        { "name": "Assassin", "role": "Tank / DPS" }
      ]
    },
    {
      "name": "Imperial Agent",
      "desc": "Assassinos e sabotadores inigualáveis, os Agents são as armas secretas do Império Sith, ajudando a garantir o controle de inúmeros sistemas estelares.",
      "playstyleTip": "Escolha se você ama espionagem e táticas — emboscadas furtivas com vibrolâmina, suporte médico de campo ou eliminar alvos à distância como um atirador de elite.",
      "advanced": [
        { "name": "Operative", "role": "Healer / DPS" },
        { "name": "Sniper", "role": "DPS" }
      ]
    },
    {
      "name": "Bounty Hunter",
      "desc": "O Império tem muitos inimigos — e eles pagarão Bounty Hunters generosamente para removê-los com eficiência implacável.",
      "playstyleTip": "Escolha se você quer tecnologia pesada e independência — lança-chamas, mísseis guiados, armadura blindada e a vida de um caçador que não responde a ninguém.",
      "advanced": [
        { "name": "Mercenary", "role": "Healer / DPS" },
        { "name": "Powertech", "role": "Tank / DPS" }
      ]
    }
  ]
}